ДЗ1
На вход некоторому исполнителю подаётся два числа (a, b). У исполнителя есть две команды
- команда 1 (к1): увеличить в с раза, а умножается на c
- команда 2 (к2): увеличить на d, к a прибавляется d
написать программу, которая выдаёт набор команд, позволяющий число a превратить в число b или сообщить, что это невозможно
Пример 1: а = 1, b = 7, c = 2, d = 1
ответ: к2, к2, к2, к2, к2, к2, k2 или к1, к1, к2, к2, к2 
Можно начать с более простого – просто подсчёта общего количества вариантов 
Пример 2: а = 11, b = 7, c = 2, d = 1
ответ: нет решения. 
*Подумать над тем, как сделать минимальное количество команд

Три медода:
Вычисляет количество путей
Печатает
находит путь (и тут же печатает его простой системной командой)

    public static void main(String[] args) {
        int start = 2;
        int end = 15;
        int summ = 1;
        int mult = 2;
        
        if (start > end)  System.out.println("нет решения");
        else if (solve(start, end, summ, mult) > 0){
            System.out.println("Возможных решений" + solve(start, end, summ, mult));
            wway(start, end, summ, mult, solve(start, end, summ, mult));
        }
        else{ System.out.println("нет решения"); }
Я пыталась засунуть числа сразу в методы, без объявления переменных, но возникала непонятная ошибка.

ДЗ2
Там 8 строчек и 3 из них сканер

ДЗ3
Там вообще одни комменты